1763274088/Hawk_A/STM32F427/BSP/l3gd20h.h
/********************************************************************************
  * @file    l3gd20h.h 
  * @author  Huangzhibin
  * @version V1.0.0
  * @date    22-12-2015
  * @brief   Header for l3gd20h.c module
*******************************************************************************/ 
#ifndef _L3GD20H_H_
#define _L3GD20H_H_
#include "stm32f4xx.h"
#include "stdint.h"
#include "spi.h"
#include "delay.h"

//**********************************************************************************//
//Macro definition area:Define the parameters of the device
//**********************************************************************************//
/****************************** START REGISTER MAPPING  *****************************/
#define L3GD20_WHO_AM_I_ADDR          0x0F  /* device identification register */
#define L3GD20_CTRL_REG1_ADDR         0x20  /* Control register 1 */
#define L3GD20_CTRL_REG2_ADDR         0x21  /* Control register 2 */
#define L3GD20_CTRL_REG3_ADDR         0x22  /* Control register 3 */
#define L3GD20_CTRL_REG4_ADDR         0x23  /* Control register 4 */
#define L3GD20_CTRL_REG5_ADDR         0x24  /* Control register 5 */
#define L3GD20_REFERENCE_REG_ADDR     0x25  /* Reference register */
#define L3GD20_OUT_TEMP_ADDR          0x26  /* Out temp register */
#define L3GD20_STATUS_REG_ADDR        0x27  /* Status register */
#define L3GD20_OUT_X_L_ADDR           0x28  /* Output Register X */
#define L3GD20_OUT_X_H_ADDR           0x29  /* Output Register X */
#define L3GD20_OUT_Y_L_ADDR           0x2A  /* Output Register Y */
#define L3GD20_OUT_Y_H_ADDR           0x2B  /* Output Register Y */
#define L3GD20_OUT_Z_L_ADDR           0x2C  /* Output Register Z */
#define L3GD20_OUT_Z_H_ADDR           0x2D  /* Output Register Z */ 
#define L3GD20_FIFO_CTRL_REG_ADDR     0x2E  /* Fifo control Register */
#define L3GD20_FIFO_SRC_REG_ADDR      0x2F  /* Fifo src Register */

#define L3GD20_INT1_CFG_ADDR          0x30  /* Interrupt 1 configuration Register */
#define L3GD20_INT1_SRC_ADDR          0x31  /* Interrupt 1 source Register */
#define L3GD20_INT1_TSH_XH_ADDR       0x32  /* Interrupt 1 Threshold X register */
#define L3GD20_INT1_TSH_XL_ADDR       0x33  /* Interrupt 1 Threshold X register */
#define L3GD20_INT1_TSH_YH_ADDR       0x34  /* Interrupt 1 Threshold Y register */
#define L3GD20_INT1_TSH_YL_ADDR       0x35  /* Interrupt 1 Threshold Y register */
#define L3GD20_INT1_TSH_ZH_ADDR       0x36  /* Interrupt 1 Threshold Z register */
#define L3GD20_INT1_TSH_ZL_ADDR       0x37  /* Interrupt 1 Threshold Z register */
#define L3GD20_INT1_DURATION_ADDR     0x38  /* Interrupt 1 DURATION register */
#define L3GD20_LOW_ODR_ADDR     			0x39  /* LOW_ODR register */
/******************************* END REGISTER MAPPING  ******************************/
/************************************************************************************/
/***************************** START SPI Interface pins  ****************************/
#define L3GD20_SPI                       SPI1
#define L3GD20_SPI_CLK                   RCC_APB2Periph_SPI1

#define L3GD20_SPI_SCK_PIN               GPIO_Pin_5                  /* PA.05 */
#define L3GD20_SPI_SCK_GPIO_PORT         GPIOA                       /* GPIOA */
#define L3GD20_SPI_SCK_GPIO_CLK          RCC_AHB1Periph_GPIOA
#define L3GD20_SPI_SCK_SOURCE            GPIO_PinSource5
#define L3GD20_SPI_SCK_AF                

#define L3GD20_SPI_MISO_PIN              GPIO_Pin_6                  /* PA.6 */
#define L3GD20_SPI_MISO_GPIO_PORT        GPIOA                       /* GPIOA */
#define L3GD20_SPI_MISO_GPIO_CLK         RCC_AHB1Periph_GPIOA
#define L3GD20_SPI_MISO_SOURCE           GPIO_PinSource6
#define L3GD20_SPI_MISO_AF               

#define L3GD20_SPI_MOSI_PIN              GPIO_Pin_7                  /* PA.7 */
#define L3GD20_SPI_MOSI_GPIO_PORT        GPIOA                       /* GPIOA */
#define L3GD20_SPI_MOSI_GPIO_CLK         RCC_AHB1Periph_GPIOA
#define L3GD20_SPI_MOSI_SOURCE           GPIO_PinSource7
#define L3GD20_SPI_MOSI_AF               

#define L3GD20_SPI_CS_PIN                GPIO_Pin_13                  /* PC.13 */
#define L3GD20_SPI_CS_GPIO_PORT          GPIOC                       /* GPIOC */
#define L3GD20_SPI_CS_GPIO_CLK           RCC_AHB1Periph_GPIOC

#define L3GD20_SPI_INT1_PIN              GPIO_Pin_0                  /* PB.00 */
#define L3GD20_SPI_INT1_GPIO_PORT        GPIOB                       /* GPIOB */
#define L3GD20_SPI_INT1_GPIO_CLK         RCC_AHB1Periph_GPIOB
#define L3GD20_SPI_INT1_EXTI_LINE        EXTI_Line0
#define L3GD20_SPI_INT1_EXTI_PORT_SOURCE EXTI_PortSourceGPIOB
#define L3GD20_SPI_INT1_EXTI_PIN_SOURCE  EXTI_PinSource0
#define L3GD20_SPI_INT1_EXTI_IRQn        EXTI0_IRQn 
/****************************** END SPI Interface pins  *****************************/
/************************************************************************************/
/************************** START l3gd20h Selection define  *************************/
//Read/Write command
#define READWRITE_CMD              				 ((uint8_t)0x80) 

//Multiple byte read/write command
#define MULTIPLEBYTE_CMD           				 ((uint8_t)0x40)

//Dummy Byte Send by the SPI Master device in order to generate the Clock to the Slave device
#define DUMMY_BYTE                 				 ((uint8_t)0x00)

//WHO_AM_I 
#define I_AM_L3GD20H		   								 ((uint8_t)0xD7)
#define WHO_I_AM													 ((uint8_t)0xD4)						
#define WHO_I_AM_L3G4200D		    					 ((uint8_t)0xD3)								/* for L3G4200D */

//Power_Mode_selection 
#define L3GD20_MODE_POWERDOWN       			 ((uint8_t)0x00)
#define L3GD20_MODE_ACTIVE          			 ((uint8_t)0x08)

//OutPut_DataRate_Selection
#define L3GD20_OUTPUT_DATARATE_1    			 ((uint8_t)0x00)
#define L3GD20_OUTPUT_DATARATE_2    			 ((uint8_t)0x40)
#define L3GD20_OUTPUT_DATARATE_3    			 ((uint8_t)0x80)
#define L3GD20_OUTPUT_DATARATE_4    			 ((uint8_t)0xC0)

//Axes_Selection 
#define L3GD20_X_ENABLE            				 ((uint8_t)0x02)
#define L3GD20_Y_ENABLE            				 ((uint8_t)0x01)
#define L3GD20_Z_ENABLE            				 ((uint8_t)0x04)
#define L3GD20_AXES_ENABLE         				 ((uint8_t)0x07)
#define L3GD20_AXES_DISABLE       				 ((uint8_t)0x00)

//BandWidth_Selection 
#define L3GD20_BANDWIDTH_1         				 ((uint8_t)0x00)
#define L3GD20_BANDWIDTH_2         				 ((uint8_t)0x10)
#define L3GD20_BANDWIDTH_3         				 ((uint8_t)0x20)
#define L3GD20_BANDWIDTH_4         				 ((uint8_t)0x30)

//Full_Scale_Selection
#define L3GD20_FULLSCALE_250               ((uint8_t)0x00)
#define L3GD20_FULLSCALE_500               ((uint8_t)0x10)
#define L3GD20_FULLSCALE_2000              ((uint8_t)0x20) 

//Block_Data_Update
#define L3GD20_BlockDataUpdate_Continous   ((uint8_t)0x00)
#define L3GD20_BlockDataUpdate_Single      ((uint8_t)0x80)

//Endian_Data_selection  
#define L3GD20_BLE_LSB                     ((uint8_t)0x00)
#define L3GD20_BLE_MSB	                   ((uint8_t)0x40)

//High_Pass_Filter_status 
#define L3GD20_HIGHPASSFILTER_DISABLE      ((uint8_t)0x00)
#define L3GD20_HIGHPASSFILTER_ENABLE	     ((uint8_t)0x10)

//INT1_Interrupt_status 
#define L3GD20_INT1INTERRUPT_DISABLE       ((uint8_t)0x00)
#define L3GD20_INT1INTERRUPT_ENABLE	   		 ((uint8_t)0x80)

//INT2_Interrupt_status  
#define L3GD20_INT2INTERRUPT_DISABLE       ((uint8_t)0x00)
#define L3GD20_INT2INTERRUPT_ENABLE	   		 ((uint8_t)0x08)

//INT1_Interrupt_ActiveEdge   
#define L3GD20_INT1INTERRUPT_LOW_EDGE      ((uint8_t)0x20)
#define L3GD20_INT1INTERRUPT_HIGH_EDGE     ((uint8_t)0x00)

//Boot_Mode_selection 
#define L3GD20_BOOT_NORMALMODE             ((uint8_t)0x00)
#define L3GD20_BOOT_REBOOTMEMORY           ((uint8_t)0x80)

//High_Pass_Filter_Mode
#define L3GD20_HPM_NORMAL_MODE_RES         ((uint8_t)0x00)
#define L3GD20_HPM_REF_SIGNAL              ((uint8_t)0x10)
#define L3GD20_HPM_NORMAL_MODE             ((uint8_t)0x20)
#define L3GD20_HPM_AUTORESET_INT           ((uint8_t)0x30)

//High_Pass_CUT OFF_Frequency 
#define L3GD20_HPFCF_0              				0x00
#define L3GD20_HPFCF_1             				  0x01
#define L3GD20_HPFCF_2              				0x02
#define L3GD20_HPFCF_3              				0x03
#define L3GD20_HPFCF_4              				0x04
#define L3GD20_HPFCF_5              				0x05
#define L3GD20_HPFCF_6             				  0x06
#define L3GD20_HPFCF_7              				0x07
#define L3GD20_HPFCF_8              				0x08
#define L3GD20_HPFCF_9              				0x09

//L3GD20H_CS_PIN
#define L3GD20_CS_LOW()       GPIO_ResetBits(L3GD20_SPI_CS_GPIO_PORT, L3GD20_SPI_CS_PIN)
#define L3GD20_CS_HIGH()      GPIO_SetBits(L3GD20_SPI_CS_GPIO_PORT, L3GD20_SPI_CS_PIN)

/* Uncomment the following line to use the default L3GD20_TIMEOUT_UserCallback() 
   function implemented in stm32f3_discovery_lgd20.c file.
   L3GD20_TIMEOUT_UserCallback() function is called whenever a timeout condition 
   occure during communication (waiting transmit data register empty flag(TXE)
   or waiting receive data register is not empty flag (RXNE)). */   
/* #define USE_DEFAULT_TIMEOUT_CALLBACK */

/* Maximum Timeout values for flags waiting loops. These timeouts are not based
   on accurate values, they just guarantee that the application will not remain
   stuck if the SPI communication is corrupted.
   You may modify these timeout values depending on CPU frequency and application
   conditions (interrupts routines ...). */   
#define L3GD20_FLAG_TIMEOUT             	 ((uint32_t)0x1000)
/*************************** END l3gd20h Selection define  **************************/
//**********************************************************************************//
//**********************************************************************************//


//**********************************************************************************//
//Definition Structure area:Defines the structure of the operating parameters
//**********************************************************************************//
/* L3GD20 struct */
typedef struct
{
  uint8_t Power_Mode;                         /* Power-down/Sleep/Normal Mode */
  uint8_t Output_DataRate;                    /* OUT data rate */
  uint8_t Axes_Enable;                        /* Axes enable */
  uint8_t Band_Width;                         /* Bandwidth selection */
  uint8_t BlockData_Update;                   /* Block Data Update */
  uint8_t Endianness;                         /* Endian Data selection */
  uint8_t Full_Scale;                         /* Full Scale selection */
}L3GD20_InitTypeDef;

/* L3GD20 High Pass Filter struct */
typedef struct
{
  uint8_t HighPassFilter_Mode_Selection;      /* Internal filter mode */
  uint8_t HighPassFilter_CutOff_Frequency;    /* High pass filter cut-off frequency */
}L3GD20_FilterConfigTypeDef;

/* L3GD20 Interrupt struct */
typedef struct
{
  uint8_t Latch_Request;                      /* Latch interrupt request into CLICK_SRC register */
  uint8_t Interrupt_Axes;                     /* X, Y, Z Axes Interrupts */ 
  uint8_t Interrupt_ActiveEdge;               /*  Interrupt Active edge */
}L3GD20_InterruptConfigTypeDef;  

/**
  * @}
  */ 
//**********************************************************************************//
//**********************************************************************************//







#endif /* _L3GD20H_H_*/

/******************* (C) COPYRIGHT 2015 Huangzhibin*****END OF FILE****/
